Tekla Open API Reference for Tekla Structures 2025
ModelObjectVisualization.GetRepresentation Method
 Gets current permanent representation (red, blue, green and transparency) of given model object
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool GetRepresentation(
	ModelObject modelObject,
	ref Color color
)
Public Shared Function GetRepresentation (
	modelObject As ModelObject,
	ByRef color As Color
) As Boolean
Parameters
modelObject
Type: Tekla.Structures.Model.ModelObject
The model object to check.
color
Type: Tekla.Structures.Model.UI.Color
The color of given model object.
Return Value
Type: Boolean
True if the permanent representation could be fetched.
See Also
Reference
ModelObjectVisualization Class
Tekla.Structures.Model.UI Namespace